In [ ]:
# 위도와 경도를 포함한 지하철 승하차 분석하기
# 데이터
# kaggle - 서울 지하철 정보
# folium - 위치 분석 시스템

In [2]:
import pandas as pd
df = pd.read_csv('./data/seoul_metro/seoul-metro-2021.logs.csv')
df

                             timestamp  station_code  people_in  people_out
0        2021-01-01T05:00:00.000+09:00           150         86          85
1        2021-01-01T06:00:00.000+09:00           150        111         355
2        2021-01-01T07:00:00.000+09:00           150        157         438
3        2021-01-01T08:00:00.000+09:00           150        306         592
4        2021-01-01T09:00:00.000+09:00           150        333         841
...                                ...           ...        ...         ...
1941548  2021-12-31T19:00:00.000+09:00          2828         74         263
1941549  2021-12-31T20:00:00.000+09:00          2828         73         145
1941550  2021-12-31T21:00:00.000+09:00          2828         95         209
1941551  2021-12-31T22:00:00.000+09:00          2828         54         138
1941552  2021-12-31T23:00:00.000+09:00          2828         18          34

[1941553 rows x 4 columns]

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1941553 entries, 0 to 1941552
Data columns (total 4 columns):
 #   Column        Dtype
---  ------        -----
 0   timestamp     object
 1   station_code  int64
 2   people_in     int64
 3   people_out    int64
dtypes: int64(3), object(1)
memory usage: 59.3+ MB

In [3]:
df.head()

                       timestamp  station_code  people_in  people_out
0  2021-01-01T05:00:00.000+09:00           150         86          85
1  2021-01-01T06:00:00.000+09:00           150        111         355
2  2021-01-01T07:00:00.000+09:00           150        157         438
3  2021-01-01T08:00:00.000+09:00           150        306         592
4  2021-01-01T09:00:00.000+09:00           150        333         841

In [3]:
station = pd.read_csv('./data/seoul_metro/seoul-metro-station-info.csv')
station.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 285 entries, 0 to 284
Data columns (total 19 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   station.code       285 non-null    int64
 1   station.fr_code    285 non-null    object
 2   line.num           285 non-null    int64
 3   line.name          285 non-null    object
 4   line.name_sub      285 non-null    object
 5   line.station_seq   285 non-null    int64
 6   station.name_full  285 non-null    object
 7   station.name       285 non-null    object
 8   station.name_chc   285 non-null    object
 9   station.name_chn   285 non-null    object
 10  station.name_en    285 non-null    object
 11  station.name_jp    285 non-null    object
 12  geo.latitude       285 non-null    float64
 13  geo.longitude      285 non-null    float64
 14  geo.sigungu_code   285 non-null    int64
 15  geo.sigungu_name   285 non-null    object
 16  geo.addres_road    285 non-null    object
 17  geo.address_land   285 non-null    object
 18  geo.phone          285 non-null    object
dtypes: float64(2), int64(4), object(13)
memory usage: 42.4+ KB

In [5]:
station.head()

,station.code,station.fr_code,line.num,line.name,line.name_sub,line.station_seq,station.name_full,station.name,station.name_chc,station.name_chn,station.name_en,station.name_jp,geo.latitude,geo.longitude,geo.sigungu_code,geo.sigungu_name,geo.addres_road,geo.address_land,geo.phone
0,158,124,1,1호선,지하철1호선,1,청량리(서울시립대입구),청량리|서울시립대입구,祭基洞,祭基洞,Jegidong,チェギドン,37.580178,127.046835,11060,동대문구,서울특별시 동대문구 왕산로 지하205(전농동),서울특별시 동대문구 전농동 620-69 청량리역(1호선),02-6110-1241
1,157,125,1,1호선,지하철1호선,2,제기동,제기동,新設洞,新设洞,Sinseoldong,シンソルトン,37.578103,127.034893,11060,동대문구,서울특별시 동대문구 왕산로 지하93(제기동),서울특별시 동대문구 제기동 65 제기동역(1호선),02-6110-1251
2,156,126,1,1호선,지하철1호선,3,신설동,신설동,東廟앞,东庙,Dongmyo,トンミョアプ,37.575297,127.025087,11060,동대문구,서울특별시 동대문구 왕산로 지하1(신설동),서울특별시 동대문구 신설동 76-5 신설동역(1호선),02-6110-1261
3,159,127,1,1호선,지하철1호선,4,동묘앞,동묘앞,淸凉里(서울市立大入口),清凉里(首尔市立大学),Cheongnyangni(University of Seoul),チョンニャンニ,37.572627,127.016429,11010,종로구,서울특별시 종로구 종로 359(숭인동),서울특별시 종로구 숭인동 117 동묘앞역(1호선),02-6110-1271
4,155,128,1,1호선,지하철1호선,5,동대문,동대문,東大門,东大门,Dongdaemun,トンデムン,37.571420,127.009745,11010,종로구,서울특별시 종로구 종로 지하302(창신동),서울특별시 종로구 창신동 492-1 동대문역(1호선),02-6110-1281

In [6]:
df.head(10)

                       timestamp  station_code  people_in  people_out
0  2021-01-01T05:00:00.000+09:00           150         86          85
1  2021-01-01T06:00:00.000+09:00           150        111         355
2  2021-01-01T07:00:00.000+09:00           150        157         438
3  2021-01-01T08:00:00.000+09:00           150        306         592
4  2021-01-01T09:00:00.000+09:00           150        333         841
5  2021-01-01T10:00:00.000+09:00           150        416         747
6  2021-01-01T11:00:00.000+09:00           150        579         625
7  2021-01-01T12:00:00.000+09:00           150        737         838
8  2021-01-01T13:00:00.000+09:00           150        696         788
9  2021-01-01T14:00:00.000+09:00           150        674         791

In [7]:
df.sum()

In [8]:
station_sum = df.groupby("station_code")[['people_in','people_out']].sum()
station_sum

              people_in  people_out
station_code
150            12697273    12109991
151             5997344     6030491
152             9638952     9284693
153             7704599     7090896
154             6651283     6609055
...                 ...         ...
2824            3206211     3097722
2825            1395919     1495603
2826            1614590     1475010
2827            1444073     1147602
2828              41623       46621

[284 rows x 2 columns]

In [9]:
station_sum.head()

              people_in  people_out
station_code
150            12697273    12109991
151             5997344     6030491
152             9638952     9284693
153             7704599     7090896
154             6651283     6609055

In [11]:
# 지하철역의 위도, 경도 추출
station_info = station[['station.code', 'geo.latitude', 'geo.longitude']]
station_info

     station.code  geo.latitude  geo.longitude
0             158     37.580178     127.046835
1             157     37.578103     127.034893
2             156     37.575297     127.025087
3             159     37.572627     127.016429
4             155     37.571420     127.009745
..            ...           ...            ...
280          2823     37.451535     127.159816
281          2824     37.445210     127.156866
282          2825     37.440918     127.147564
283          2826     37.437428     127.140722
284          2827     37.432130     127.129087

[285 rows x 3 columns]

In [12]:
# 데이터프레임 조인( 합치기 )
# 인덱스를 동일하게 설정해줘야 함!
station_sum.head()

              people_in  people_out
station_code
150            12697273    12109991
151             5997344     6030491
152             9638952     9284693
153             7704599     7090896
154             6651283     6609055

In [13]:
station_info.head()

   station.code  geo.latitude  geo.longitude
0           158     37.580178     127.046835
1           157     37.578103     127.034893
2           156     37.575297     127.025087
3           159     37.572627     127.016429
4           155     37.571420     127.009745

In [21]:
staion_info = staion_info.set_index('station.code')
staion_info

              geo.latitude  geo.longitude
station.code
158              37.580178     127.046835
157              37.578103     127.034893
156              37.575297     127.025087
159              37.572627     127.016429
155              37.571420     127.009745
...                    ...            ...
2823             37.451535     127.159816
2824             37.445210     127.156866
2825             37.440918     127.147564
2826             37.437428     127.140722
2827             37.432130     127.129087

[285 rows x 2 columns]

In [24]:
joind = station_sum.join(staion_info)
joind.head()

              people_in  people_out  geo.latitude  geo.longitude
station_code
150            12697273    12109991     37.554648     126.972559
151             5997344     6030491     37.564718     126.977108
152             9638952     9284693     37.570161     126.982923
153             7704599     7090896     37.571607     126.991806
154             6651283     6609055     37.570926     127.001849

In [27]:
# dfa = pd.concat([station_sum, station_info], axis=1).set_index(staion_info['staion_code'])
dfa.head()

      people_in  people_out  station.code  geo.latitude  geo.longitude
150  12697273.0  12109991.0        2540.0     37.557322     127.029476
151   5997344.0   6030491.0        2541.0     37.561533     127.037732
152   9638952.0   9284693.0        2542.0     37.566100     127.042973
153   7704599.0   7090896.0        2543.0     37.566747     127.052704
154   6651283.0   6609055.0        2544.0     37.561440     127.064623

In [ ]:
# folium 지도 라이브러리